<?php require_once 'header.php'; ?>

    <main class="page-container page-content">
        <h1 class="page-title">Автовыбор</h1>

        <div class="commit-main">
            <h2>Все коммиты</h2>
            <h3>Затраченное время - 90 часов</h3>
            <div class="commit-group">
                <div class="commit-group__item">
                    <p> Сделал футер и хедер Сделал футер и хедер Сделал футер и хедер Сделал футер и хедер Сделал футер и хедер Сделал футер и хедер Сделал футер и хедер Сделал футер и хедер</p>
                    <div class="commit-group__item_small">
                        <p>1 час</p>
                        <p>16/02/2023</p>
                    </div>
                </div>
                <div class="commit-group__item">
                    <p>Сделал футер и хедер</p>
                    <div class="commit-group__item_small">
                        <p>1 час</p>
                        <p>16/02/2023</p>
                    </div>
                </div>
                <div class="commit-group__item">
                    <p>Сделал футер и хедер</p>
                    <div class="commit-group__item_small">
                        <p>1 час</p>
                        <p>16/02/2023</p>
                    </div>
                </div>
                <div class="commit-group__item">
                    <p>Сделал футер и хедер</p>
                    <div class="commit-group__item_small">
                        <p>1 час</p>
                        <p>16/02/2023</p>
                    </div>
                </div>
                <div class="commit-group__item">
                    <p>Сделал футер и хедер</p>
                    <div class="commit-group__item_small">
                        <p>1 час</p>
                        <p>16/02/2023</p>
                    </div>
                </div>
                <div class="commit-group__item">
                    <p>Сделал футер и хедер</p>
                    <div class="commit-group__item_small">
                        <p>1 час</p>
                        <p>16/02/2023</p>
                    </div>
                </div>
            </div>    
        </div>

        <form class="commit-buttons" action="">
            <button class="page-button" id="open-add-group">Добавить группу</button>
            <button class="page-button" id="open-add-commit">Добавить коммит</button>
        </form>

        <div class="commits-list">
            <div class="commit-main commit-background">
                <div class="content-delete">
                    <svg width="33" height="33" viewBox="0 0 33 33" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M32.2691 0.755965C32.0375 0.523926 31.7624 0.339835 31.4596 0.214229C31.1568 0.0886235 30.8322 0.0239698 30.5044 0.0239698C30.1766 0.0239698 29.852 0.0886235 29.5492 0.214229C29.2464 0.339835 28.9714 0.523926 28.7398 0.755965L16.5 12.9707L4.2602 0.730935C4.02847 0.4992 3.75336 0.315377 3.45058 0.189963C3.14781 0.0645491 2.82329 2.44172e-09 2.49557 0C2.16785 -2.44173e-09 1.84333 0.0645491 1.54056 0.189963C1.23778 0.315377 0.96267 0.4992 0.730935 0.730935C0.4992 0.96267 0.315377 1.23778 0.189963 1.54056C0.0645491 1.84333 -2.44172e-09 2.16785 0 2.49557C2.44173e-09 2.82329 0.0645491 3.14781 0.189963 3.45058C0.315377 3.75336 0.4992 4.02847 0.730935 4.2602L12.9707 16.5L0.730935 28.7398C0.4992 28.9715 0.315377 29.2466 0.189963 29.5494C0.0645491 29.8522 0 30.1767 0 30.5044C0 30.8322 0.0645491 31.1567 0.189963 31.4594C0.315377 31.7622 0.4992 32.0373 0.730935 32.2691C0.96267 32.5008 1.23778 32.6846 1.54056 32.81C1.84333 32.9355 2.16785 33 2.49557 33C2.82329 33 3.14781 32.9355 3.45058 32.81C3.75336 32.6846 4.02847 32.5008 4.2602 32.2691L16.5 20.0293L28.7398 32.2691C28.9715 32.5008 29.2466 32.6846 29.5494 32.81C29.8522 32.9355 30.1767 33 30.5044 33C30.8322 33 31.1567 32.9355 31.4594 32.81C31.7622 32.6846 32.0373 32.5008 32.2691 32.2691C32.5008 32.0373 32.6846 31.7622 32.81 31.4594C32.9355 31.1567 33 30.8322 33 30.5044C33 30.1767 32.9355 29.8522 32.81 29.5494C32.6846 29.2466 32.5008 28.9715 32.2691 28.7398L20.0293 16.5L32.2691 4.2602C33.2202 3.30905 33.2202 1.70712 32.2691 0.755965Z" fill="#DF3E3E"/>
                    </svg>
                </div>

                <h2>Группа 1</h2>
                <h3>Затраченное время - 90 часов</h3>
                <div class="commit-group">
                    <div class="commit-group__item">
                        <p>Сделал футер и хедер</p>
                        <div class="commit-group__item_small">
                            <p>1 час</p>
                            <p>16/02/2023</p>
                        </div>
                    </div>
                    <div class="commit-group__item">
                        <p>Сделал футер и хедер</p>
                        <div class="commit-group__item_small">
                            <p>1 час</p>
                            <p>16/02/2023</p>
                        </div>
                    </div>
                    <div class="commit-group__item">
                        <p>Сделал футер и хедер</p>
                        <div class="commit-group__item_small">
                            <p>1 час</p>
                            <p>16/02/2023</p>
                        </div>
                    </div>
                    <div class="commit-group__item">
                        <p>Сделал футер и хедер</p>
                        <div class="commit-group__item_small">
                            <p>1 час</p>
                            <p>16/02/2023</p>
                        </div>
                    </div>
                    <div class="commit-group__item">
                        <p>Сделал футер и хедер</p>
                        <div class="commit-group__item_small">
                            <p>1 час</p>
                            <p>16/02/2023</p>
                        </div>
                    </div>
                    <div class="commit-group__item">
                        <p>Сделал футер и хедер</p>
                        <div class="commit-group__item_small">
                            <p>1 час</p>
                            <p>16/02/2023</p>
                        </div>
                    </div>
                </div>    
            </div>
            <div class="commit-main commit-background">
                <div class="content-delete">
                    <svg width="33" height="33" viewBox="0 0 33 33" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M32.2691 0.755965C32.0375 0.523926 31.7624 0.339835 31.4596 0.214229C31.1568 0.0886235 30.8322 0.0239698 30.5044 0.0239698C30.1766 0.0239698 29.852 0.0886235 29.5492 0.214229C29.2464 0.339835 28.9714 0.523926 28.7398 0.755965L16.5 12.9707L4.2602 0.730935C4.02847 0.4992 3.75336 0.315377 3.45058 0.189963C3.14781 0.0645491 2.82329 2.44172e-09 2.49557 0C2.16785 -2.44173e-09 1.84333 0.0645491 1.54056 0.189963C1.23778 0.315377 0.96267 0.4992 0.730935 0.730935C0.4992 0.96267 0.315377 1.23778 0.189963 1.54056C0.0645491 1.84333 -2.44172e-09 2.16785 0 2.49557C2.44173e-09 2.82329 0.0645491 3.14781 0.189963 3.45058C0.315377 3.75336 0.4992 4.02847 0.730935 4.2602L12.9707 16.5L0.730935 28.7398C0.4992 28.9715 0.315377 29.2466 0.189963 29.5494C0.0645491 29.8522 0 30.1767 0 30.5044C0 30.8322 0.0645491 31.1567 0.189963 31.4594C0.315377 31.7622 0.4992 32.0373 0.730935 32.2691C0.96267 32.5008 1.23778 32.6846 1.54056 32.81C1.84333 32.9355 2.16785 33 2.49557 33C2.82329 33 3.14781 32.9355 3.45058 32.81C3.75336 32.6846 4.02847 32.5008 4.2602 32.2691L16.5 20.0293L28.7398 32.2691C28.9715 32.5008 29.2466 32.6846 29.5494 32.81C29.8522 32.9355 30.1767 33 30.5044 33C30.8322 33 31.1567 32.9355 31.4594 32.81C31.7622 32.6846 32.0373 32.5008 32.2691 32.2691C32.5008 32.0373 32.6846 31.7622 32.81 31.4594C32.9355 31.1567 33 30.8322 33 30.5044C33 30.1767 32.9355 29.8522 32.81 29.5494C32.6846 29.2466 32.5008 28.9715 32.2691 28.7398L20.0293 16.5L32.2691 4.2602C33.2202 3.30905 33.2202 1.70712 32.2691 0.755965Z" fill="#DF3E3E"/>
                    </svg>
                </div>

                <h2>Группа 2</h2>
                <h3>Затраченное время - 90 часов</h3>
                <div class="commit-group">
                    <div class="commit-group__item">
                        <p>Сделал футер и хедер</p>
                        <div class="commit-group__item_small">
                            <p>1 час</p>
                            <p>16/02/2023</p>
                        </div>
                    </div>
                    <div class="commit-group__item">
                        <p>Сделал футер и хедер</p>
                        <div class="commit-group__item_small">
                            <p>1 час</p>
                            <p>16/02/2023</p>
                        </div>
                    </div>
                    <div class="commit-group__item">
                        <p>Сделал футер и хедер</p>
                        <div class="commit-group__item_small">
                            <p>1 час</p>
                            <p>16/02/2023</p>
                        </div>
                    </div>
                    <div class="commit-group__item">
                        <p>Сделал футер и хедер</p>
                        <div class="commit-group__item_small">
                            <p>1 час</p>
                            <p>16/02/2023</p>
                        </div>
                    </div>
                    <div class="commit-group__item">
                        <p>Сделал футер и хедер</p>
                        <div class="commit-group__item_small">
                            <p>1 час</p>
                            <p>16/02/2023</p>
                        </div>
                    </div>
                    <div class="commit-group__item">
                        <p>Сделал футер и хедер</p>
                        <div class="commit-group__item_small">
                            <p>1 час</p>
                            <p>16/02/2023</p>
                        </div>
                    </div>
                </div>    
            </div>
        </div>
        
    </main>
    <div class="modal-wrapper" id="modal-add-commit">
        <div class="modal modal-large page-container">
            <div class="content-delete" id="close-add-commit">
                <svg viewBox="0 0 33 33" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M32.2691 0.755965C32.0375 0.523926 31.7624 0.339835 31.4596 0.214229C31.1568 0.0886235 30.8322 0.0239698 30.5044 0.0239698C30.1766 0.0239698 29.852 0.0886235 29.5492 0.214229C29.2464 0.339835 28.9714 0.523926 28.7398 0.755965L16.5 12.9707L4.2602 0.730935C4.02847 0.4992 3.75336 0.315377 3.45058 0.189963C3.14781 0.0645491 2.82329 2.44172e-09 2.49557 0C2.16785 -2.44173e-09 1.84333 0.0645491 1.54056 0.189963C1.23778 0.315377 0.96267 0.4992 0.730935 0.730935C0.4992 0.96267 0.315377 1.23778 0.189963 1.54056C0.0645491 1.84333 -2.44172e-09 2.16785 0 2.49557C2.44173e-09 2.82329 0.0645491 3.14781 0.189963 3.45058C0.315377 3.75336 0.4992 4.02847 0.730935 4.2602L12.9707 16.5L0.730935 28.7398C0.4992 28.9715 0.315377 29.2466 0.189963 29.5494C0.0645491 29.8522 0 30.1767 0 30.5044C0 30.8322 0.0645491 31.1567 0.189963 31.4594C0.315377 31.7622 0.4992 32.0373 0.730935 32.2691C0.96267 32.5008 1.23778 32.6846 1.54056 32.81C1.84333 32.9355 2.16785 33 2.49557 33C2.82329 33 3.14781 32.9355 3.45058 32.81C3.75336 32.6846 4.02847 32.5008 4.2602 32.2691L16.5 20.0293L28.7398 32.2691C28.9715 32.5008 29.2466 32.6846 29.5494 32.81C29.8522 32.9355 30.1767 33 30.5044 33C30.8322 33 31.1567 32.9355 31.4594 32.81C31.7622 32.6846 32.0373 32.5008 32.2691 32.2691C32.5008 32.0373 32.6846 31.7622 32.81 31.4594C32.9355 31.1567 33 30.8322 33 30.5044C33 30.1767 32.9355 29.8522 32.81 29.5494C32.6846 29.2466 32.5008 28.9715 32.2691 28.7398L20.0293 16.5L32.2691 4.2602C33.2202 3.30905 33.2202 1.70712 32.2691 0.755965Z" fill="#DF3E3E"/>
                </svg>
            </div>
            <h1 class="page-title">Добавить коммит</h1>
            <form action="" class="form__large">
                <label for="">
                    <span>Группа</span>
                    <input type="text" name="group">
                </label>
                <label for="">
                    <span>Время</span>
                    <div class="modal-input__time">
                        <input type="text" name="label" placeholder="Часы">
                        <p>:</p>
                        <input type="text" name="label" placeholder="Минуты">
                    </div>
                </label>
                <label for="">
                    <span>Название</span>
                    <input type="text" name="name">
                </label>
                <label for="">
                    <span>Дата</span>
                    <input type="date" name="label">
                </label>
                <button class="page-button">Добавить</button>
            </form>
        </div>
    </div>

    <div class="modal-wrapper" id="modal-add-group">
        <div class="modal page-container">
            <div class="content-delete" id="close-add-group">
                <svg viewBox="0 0 33 33" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M32.2691 0.755965C32.0375 0.523926 31.7624 0.339835 31.4596 0.214229C31.1568 0.0886235 30.8322 0.0239698 30.5044 0.0239698C30.1766 0.0239698 29.852 0.0886235 29.5492 0.214229C29.2464 0.339835 28.9714 0.523926 28.7398 0.755965L16.5 12.9707L4.2602 0.730935C4.02847 0.4992 3.75336 0.315377 3.45058 0.189963C3.14781 0.0645491 2.82329 2.44172e-09 2.49557 0C2.16785 -2.44173e-09 1.84333 0.0645491 1.54056 0.189963C1.23778 0.315377 0.96267 0.4992 0.730935 0.730935C0.4992 0.96267 0.315377 1.23778 0.189963 1.54056C0.0645491 1.84333 -2.44172e-09 2.16785 0 2.49557C2.44173e-09 2.82329 0.0645491 3.14781 0.189963 3.45058C0.315377 3.75336 0.4992 4.02847 0.730935 4.2602L12.9707 16.5L0.730935 28.7398C0.4992 28.9715 0.315377 29.2466 0.189963 29.5494C0.0645491 29.8522 0 30.1767 0 30.5044C0 30.8322 0.0645491 31.1567 0.189963 31.4594C0.315377 31.7622 0.4992 32.0373 0.730935 32.2691C0.96267 32.5008 1.23778 32.6846 1.54056 32.81C1.84333 32.9355 2.16785 33 2.49557 33C2.82329 33 3.14781 32.9355 3.45058 32.81C3.75336 32.6846 4.02847 32.5008 4.2602 32.2691L16.5 20.0293L28.7398 32.2691C28.9715 32.5008 29.2466 32.6846 29.5494 32.81C29.8522 32.9355 30.1767 33 30.5044 33C30.8322 33 31.1567 32.9355 31.4594 32.81C31.7622 32.6846 32.0373 32.5008 32.2691 32.2691C32.5008 32.0373 32.6846 31.7622 32.81 31.4594C32.9355 31.1567 33 30.8322 33 30.5044C33 30.1767 32.9355 29.8522 32.81 29.5494C32.6846 29.2466 32.5008 28.9715 32.2691 28.7398L20.0293 16.5L32.2691 4.2602C33.2202 3.30905 33.2202 1.70712 32.2691 0.755965Z" fill="#DF3E3E"/>
                </svg>
            </div>
            <h1 class="page-title">Добавить группу</h1>
            <form action="" class="form__small">
                <label for="">
                    <span>Название</span>
                    <input type="text">
                </label>
                <button class="page-button">Добавить</button>
            </form>
        </div>
    </div>
<?php require_once 'footer.php'; ?>